src_Extension/Documents/ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланПродаж</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Documents/ПланПродаж/Ext/ObjectModule.bsl
&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если ЭтоНовый()
	Тогда
		ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	ВЫБОР
	|		КОГДА ПланПродажНаУтверждении.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК МожетУстанавливатьСтатусНаУтверждении,
	|	ВЫБОР
	|		КОГДА ПланПродажУтвержден.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК МожетУстанавливатьСтатусУтвержден
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	|			ГруппыПользователейСостав.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ГДЕ
	|			ГруппыПользователейСостав.Пользователь = &Пользователь
	|			И ГруппыПользователейСостав.Ссылка.Наименование = &ПланПродажНаУтверждении) КАК ПланПродажНаУтверждении
	|		ПО Пользователи.Ссылка = ПланПродажНаУтверждении.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	|			ГруппыПользователейСостав.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ГДЕ
	|			ГруппыПользователейСостав.Пользователь = &Пользователь
	|			И ГруппыПользователейСостав.Ссылка.Наименование = &ПланПродажУтвержден) КАК ПланПродажУтвержден
	|		ПО Пользователи.Ссылка = ПланПродажУтвержден.Пользователь
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	Запрос.УстановитьПараметр( "Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр( "ПланПродажУтвержден", "План продаж - Утвержден");
	Запрос.УстановитьПараметр( "ПланПродажНаУтверждении", "План продаж - На утверждении");
	Выб = Запрос.Выполнить().Выбрать();
	Если Не Выб.Следующий()
	Тогда
		МожетУстанавливатьСтатусНаУтверждении = Ложь;
		МожетУстанавливатьСтатусУтвержден = Ложь;
	Иначе
		МожетУстанавливатьСтатусНаУтверждении = Выб.МожетУстанавливатьСтатусНаУтверждении;
		МожетУстанавливатьСтатусУтвержден = Выб.МожетУстанавливатьСтатусУтвержден;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПланПродаж.Ссылка КАК Ссылка,
	|	ПланПродаж.ВерсияДанных КАК ВерсияДанных,
	|	ПланПродаж.ПометкаУдаления КАК ПометкаУдаления,
	|	ПланПродаж.Номер КАК Номер,
	|	ПланПродаж.Дата КАК Дата,
	|	ПланПродаж.Проведен КАК Проведен,
	|	ПланПродаж.Комментарий КАК Комментарий,
	|	ПланПродаж.Подразделение КАК Подразделение,
	|	ПланПродаж.Статус КАК Статус,
	|	ПланПродаж.Периодичность КАК Периодичность,
	|	ПланПродаж.НачалоПериода КАК НачалоПериода,
	|	ПланПродаж.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ПланПродаж.Менеджер КАК Менеджер,
	|	ПланПродаж.ОбновитьДополнить КАК ОбновитьДополнить,
	|	ПланПродаж.ИзменитьРезультатНа КАК ИзменитьРезультатНа,
	|	ПланПродаж.ТочностьОкругления КАК ТочностьОкругления,
	|	ПланПродаж.ПользовательскиеНастройки КАК ПользовательскиеНастройки,
	|	ПланПродаж.РаспределитьПоРабочимДням КАК РаспределитьПоРабочимДням,
	|	ПланПродаж.Сценарий КАК Сценарий,
	|	ПланПродаж.ВидПлана КАК ВидПлана,
	|	ПланПродаж.СуммаДокумента КАК СуммаДокумента,
	|	ПланПродаж.ПланироватьПоСумме КАК ПланироватьПоСумме,
	|	ПланПродаж.Валюта КАК Валюта,
	|	ПланПродаж.ЗаполненоАвтоматически КАК ЗаполненоАвтоматически,
	|	ПланПродаж.КроссТаблица КАК КроссТаблица,
	|	ПланПродаж.Партнер КАК Партнер,
	|	ПланПродаж.Соглашение КАК Соглашение,
	|	ПланПродаж.Склад КАК Склад,
	|	ПланПродаж.ГрафикОплаты КАК ГрафикОплаты,
	|	ПланПродаж.Календарь КАК Календарь,
	|	ПланПродаж.Договор КАК Договор,
	|	ПланПродаж.ЗаполнятьПланОплат КАК ЗаполнятьПланОплат,
	|	ПланПродаж.СтруктураНастроек КАК СтруктураНастроек,
	|	ПланПродаж.ЗаполнятьПоФормуле КАК ЗаполнятьПоФормуле,
	|	ПланПродаж.ОтражаетсяВБюджетировании КАК ОтражаетсяВБюджетировании,
	|	ПланПродаж.СтатьяБюджетов КАК СтатьяБюджетов,
	|	ПланПродаж.СценарийБюджетирования КАК СценарийБюджетирования,
	|	ПланПродаж.Ответственный КАК Ответственный,
	|	ПланПродаж.ФорматМагазина КАК ФорматМагазина,
	|	ПланПродаж.ОтражаетсяВБюджетированииОплаты КАК ОтражаетсяВБюджетированииОплаты,
	|	ПланПродаж.СтатьяБюджетовОплат КАК СтатьяБюджетовОплат,
	|	ПланПродаж.ОтражаетсяВБюджетированииОплатыКредит КАК ОтражаетсяВБюджетированииОплатыКредит,
	|	ПланПродаж.СтатьяБюджетовОплатКредит КАК СтатьяБюджетовОплатКредит,
	|	ПланПродаж.Замещающий КАК Замещающий,
	|	ПланПродаж.Назначение КАК Назначение,
	|	ПланПродаж.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Упаковка КАК Упаковка,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество,
	|		ДатаОтгрузки КАК ДатаОтгрузки,
	|		Отменено КАК Отменено,
	|		Склад КАК Склад,
	|		Комментарий КАК Комментарий,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Партнер КАК Партнер,
	|		Соглашение КАК Соглашение,
	|		ДополнительныеПараметры КАК ДополнительныеПараметры,
	|		Назначение КАК Назначение,
	|		Замещен КАК Замещен
	|	) КАК Товары,
	|	ПланПродаж.ПравилоЗаполнения.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Использование КАК Использование,
	|		Исключать КАК Исключать,
	|		ВариантПреобразования КАК ВариантПреобразования,
	|		Источник КАК Источник,
	|		Период КАК Период,
	|		Дата КАК Дата,
	|		ТипЭлемента КАК ТипЭлемента,
	|		НомерСтрокиРодитель КАК НомерСтрокиРодитель,
	|		ПользовательскиеНастройки КАК ПользовательскиеНастройки,
	|		ИзменитьРезультатНа КАК ИзменитьРезультатНа,
	|		Присоединять КАК Присоединять
	|	) КАК ПравилоЗаполнения,
	|	ПланПродаж.ПланОплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВариантОплаты КАК ВариантОплаты,
	|		ДатаПлатежа КАК ДатаПлатежа,
	|		ПроцентПлатежа КАК ПроцентПлатежа,
	|		СуммаПлатежа КАК СуммаПлатежа,
	|		СуммаЗадолженности КАК СуммаЗадолженности,
	|		СуммаОтгрузок КАК СуммаОтгрузок,
	|		СуммаПлатежей КАК СуммаПлатежей,
	|		Комментарий КАК Комментарий,
	|		ДатаОтгрузки КАК ДатаОтгрузки,
	|		Замещен КАК Замещен
	|	) КАК ПланОплаты,
	|	ПланПродаж.ЭтапыГрафикаОплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВариантОплаты КАК ВариантОплаты,
	|		Сдвиг КАК Сдвиг,
	|		ПроцентПлатежа КАК ПроцентПлатежа,
	|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару
	|	) КАК ЭтапыГрафикаОплаты,
	|	ПланПродаж.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты
	|ИЗ
	|	Документ.ПланПродаж КАК ПланПродаж
	|ГДЕ
	|	ПланПродаж.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр( "Ссылка", Ссылка );
	Выб = Запрос.Выполнить().Выбрать();
	Выб.Следующий();
	ПредСтатус  = Выб.Статус;
	
	Если ПредСтатус <> Статус
	Тогда
		Если Статус = Перечисления.СтатусыПланов.Утвержден
		Тогда
			Если ПредСтатус <> Перечисления.СтатусыПланов.НаУтверждении
		        Тогда
				Сооб = Новый СообщениеПользователю;
				Сооб.Текст = "Статус ""Утвержден"" разрешено устанавливать только из статуса ""На утверждении""";
				Сооб.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	
		Если ПредСтатус = Перечисления.СтатусыПланов.Утвержден Или
			Статус = Перечисления.СтатусыПланов.Утвержден
		Тогда
			Если Не  МожетУстанавливатьСтатусУтвержден
		        Тогда
				Сооб = Новый СообщениеПользователю;
				Сооб.Текст = "Вам не разрешено устанавливать статус ""Утвержден"" для плана продаж";
				Сооб.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли ПредСтатус = Перечисления.СтатусыПланов.НаУтверждении Или
			Статус = Перечисления.СтатусыПланов.НаУтверждении
		Тогда
			Если Не  МожетУстанавливатьСтатусНаУтверждении
		        Тогда
				Сооб = Новый СообщениеПользователю;
				Сооб.Текст = "Вам не разрешено устанавливать статус ""На утверждении"" для плана продаж";
				Сооб.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыПланов.ВПодготовке
	Тогда
		РазрешеноРедактироватьТабличнуюЧасть = Истина;
	Иначе
		РазрешеноРедактироватьТабличнуюЧасть = Ложь;
	КонецЕсли;		
	
	Если Не Отказ И Не РазрешеноРедактироватьТабличнуюЧасть
	Тогда
		ПредТовары = Выб.Товары.Выгрузить();
		Для Каждого Товар из Товары
		Цикл
			ПараметрыОтбора = Новый Структура("Номенклатура, КоличествоУпаковок, ДатаОтгрузки, Партнер, Назначение", 
					Товар.Номенклатура,
					Товар.КоличествоУпаковок,
					Товар.ДатаОтгрузки,
					Товар.Партнер,
					Товар.Назначение );
			МассивСтрок = ПредТовары.НайтиСтроки( ПараметрыОтбора );
			Если МассивСтрок.Количество() <> 1
			Тогда
				Сооб = Новый СообщениеПользователю;
				Сооб.Текст = "Изменять состав плана продаж разрешено только в статусе ""Формируется""";
				Сооб.Сообщить();
				Отказ = Истина;
				Прервать ;
			КонецЕсли;
			ПредТовары.Удалить( МассивСтрок[0] );
		КонецЦикла;
		
		Если ПредТовары.Количество() <> 0
		Тогда
			Сооб = Новый СообщениеПользователю;
			Сооб.Текст = "Изменять состав плана продаж разрешено только в статусе ""Формируется""";
			Сооб.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
	
	
КонецПроцедуры
